## Plan Result (sds_ithc_ado)




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.aks_mi_datasharelanding_contributor[0]
  * azurerm_role_assignment.mi_adhoc_contributor[0]
  * azurerm_role_assignment.mi_audit_contributor[0]
  * azurerm_role_assignment.mi_export_contributor[0]
  * azurerm_role_assignment.mi_landing_contributor[0]
  * azurerm_role_assignment.mi_pds_contributor[0]
  * azurerm_role_assignment.mi_polybasestaging_contributor[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.aks_mi_datasharelanding_contributor[0] will be created
  + resource "azurerm_role_assignment" "aks_mi_datasharelanding_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-ithc-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.Storage/storageAccounts/midatasharelandingithc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_adhoc_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_adhoc_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-ithc-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.Storage/storageAccounts/miadhoclandingithc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_audit_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_audit_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-ithc-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.Storage/storageAccounts/miauditithc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_export_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_export_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-ithc-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.Storage/storageAccounts/miexportithc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_landing_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_landing_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-ithc-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.Storage/storageAccounts/milandingithc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_pds_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_pds_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-ithc-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.Storage/storageAccounts/mipersistentithc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_polybasestaging_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_polybasestaging_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-ithc-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingithc"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Target":"sds_ithc_ado","Vars":{}} -->